{"format": "graph-model", "generatedBy": "2.13.0", "convertedBy": "TensorFlow.js Converter v4.10.0", "signature": {"inputs": {"xs_1": {"name": "xs_1:0", "dtype": "DT_INT32", "tensorShape": {}}, "xs_2": {"name": "xs_2:0", "dtype": "DT_FLOAT", "tensorShape": {}}, "xs_0": {"name": "xs_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "65280"}]}}}, "outputs": {"output_2": {"name": "Identity_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "2"}]}}, "output_1": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {}}, "output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "65280"}]}}}}, "modelTopology": {"node": [{"name": "PartitionedCall/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__lambda__/Neg", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_unknown_/jvp/pjit__reduce_sum_/Sum_1/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__reduce_sum_/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__reduce_sum_/BroadcastTo/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Const_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_unknown_/jvp/pjit_fn_/Cast_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_unknown_/jvp/pjit_fn_/Mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "15"}, {"size": "15"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_unknown_/pjit__one_hot_/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_unknown_/pjit__one_hot_/BroadcastTo_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "15"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_unknown_/jvp/pjit_matmul_/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_unknown_/jvp/pjit__reduce_sum_/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_unknown_/jvp/pjit__reduce_max_/Max/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Const_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_unknown_/jvp/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__reduce_sum_/Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__reduce_sum_/BroadcastTo_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "15"}, {"size": "65280"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_unknown_/jvp/pjit__lambda__/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__lambda__/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__lambda__/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__lambda__/Sum_1/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Const_12", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "65280"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_unknown_/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_unknown_/transpose", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "65280"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "xs_0", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "65280"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "xs_1", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_INT32"}}}, {"name": "xs_2", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_unknown_/jvp/pjit__lambda__/Reshape", "op": "Reshape", "input": ["xs_0", "PartitionedCall/jax2tf_unknown_/jvp/pjit__lambda__/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_unknown_/pjit__one_hot_/Reshape", "op": "Reshape", "input": ["xs_1", "PartitionedCall/jax2tf_unknown_/pjit__one_hot_/Reshape/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_unknown_/jvp/pjit__lambda__/Sub", "op": "Sub", "input": ["PartitionedCall/Const", "PartitionedCall/jax2tf_unknown_/jvp/pjit__lambda__/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_unknown_/pjit__one_hot_/Equal", "op": "Equal", "input": ["PartitionedCall/jax2tf_unknown_/pjit__one_hot_/Reshape", "PartitionedCall/jax2tf_unknown_/pjit__one_hot_/BroadcastTo_1"], "attr": {"T": {"type": "DT_INT32"}, "incompatible_shape_error": {"b": true}}}, {"name": "PartitionedCall/jax2tf_unknown_/jvp/ArithmeticOptimizer/ReplaceMulWithSquare_Mul", "op": "Square", "input": ["PartitionedCall/jax2tf_unknown_/jvp/pjit__lambda__/Sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_unknown_/pjit__one_hot_/Cast_1", "op": "Cast", "input": ["PartitionedCall/jax2tf_unknown_/pjit__one_hot_/Equal"], "attr": {"SrcT": {"type": "DT_BOOL"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "PartitionedCall/jax2tf_unknown_/jvp/pjit__reduce_sum_/Sum", "op": "Sum", "input": ["PartitionedCall/jax2tf_unknown_/jvp/ArithmeticOptimizer/ReplaceMulWithSquare_Mul", "PartitionedCall/jax2tf_unknown_/jvp/pjit__reduce_sum_/Sum/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/jax2tf_unknown_/jvp/pjit_matmul_/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/jax2tf_unknown_/pjit__one_hot_/Cast_1", "PartitionedCall/jax2tf_unknown_/jvp/pjit_matmul_/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_unknown_/jvp/pjit_matmul_/MatMul", "op": "MatMul", "input": ["PartitionedCall/jax2tf_unknown_/jvp/pjit_fn_/Mul", "PartitionedCall/jax2tf_unknown_/jvp/pjit_matmul_/ExpandDims"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "PartitionedCall/jax2tf_unknown_/jvp/pjit_matmul_/Squeeze", "op": "Squeeze", "input": ["PartitionedCall/jax2tf_unknown_/jvp/pjit_matmul_/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "PartitionedCall/jax2tf_unknown_/jvp/pjit_fn_/Mul_1", "op": "Mul", "input": ["PartitionedCall/jax2tf_unknown_/jvp/pjit_fn_/Cast_1", "PartitionedCall/jax2tf_unknown_/jvp/pjit_matmul_/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_unknown_/jvp/pjit_fn_/AddV2", "op": "Sub", "input": ["PartitionedCall/jax2tf_unknown_/jvp/pjit_fn_/Mul_1", "PartitionedCall/jax2tf_unknown_/jvp/pjit__reduce_sum_/Sum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_unknown_/jvp/pjit_fn_/Mul_2", "op": "Mul", "input": ["PartitionedCall/Const_5", "PartitionedCall/jax2tf_unknown_/jvp/pjit_fn_/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_unknown_/jvp/pjit__reduce_max_/Max", "op": "Max", "input": ["PartitionedCall/jax2tf_unknown_/jvp/pjit_fn_/Mul_2", "PartitionedCall/jax2tf_unknown_/jvp/pjit__reduce_max_/Max/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/jax2tf_unknown_/jvp/pjit_isfinite_/IsFinite", "op": "IsFinite", "input": ["PartitionedCall/jax2tf_unknown_/jvp/pjit__reduce_max_/Max"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_unknown_/jvp/SelectV2", "op": "SelectV2", "input": ["PartitionedCall/jax2tf_unknown_/jvp/pjit_isfinite_/IsFinite", "PartitionedCall/jax2tf_unknown_/jvp/pjit__reduce_max_/Max", "PartitionedCall/Const_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_unknown_/jvp/Reshape", "op": "Reshape", "input": ["PartitionedCall/jax2tf_unknown_/jvp/SelectV2", "PartitionedCall/jax2tf_unknown_/jvp/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_unknown_/jvp/Sub", "op": "Sub", "input": ["PartitionedCall/jax2tf_unknown_/jvp/pjit_fn_/Mul_2", "PartitionedCall/jax2tf_unknown_/jvp/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_unknown_/jvp/Exp", "op": "Exp", "input": ["PartitionedCall/jax2tf_unknown_/jvp/Sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_unknown_/jvp/pjit__reduce_sum_/Sum_1", "op": "Sum", "input": ["PartitionedCall/jax2tf_unknown_/jvp/Exp", "PartitionedCall/jax2tf_unknown_/jvp/pjit__reduce_sum_/Sum_1/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/jax2tf_unknown_/jvp/Log", "op": "Log", "input": ["PartitionedCall/jax2tf_unknown_/jvp/pjit__reduce_sum_/Sum_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_unknown_/transpose/jvp/truediv", "op": "RealDiv", "input": ["PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__lambda__/Neg", "PartitionedCall/jax2tf_unknown_/jvp/pjit__reduce_sum_/Sum_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_unknown_/jvp/AddV2", "op": "AddV2", "input": ["PartitionedCall/jax2tf_unknown_/jvp/Log", "PartitionedCall/jax2tf_unknown_/jvp/SelectV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__reduce_sum_/Reshape", "op": "Reshape", "input": ["PartitionedCall/jax2tf_unknown_/transpose/jvp/truediv", "PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__reduce_sum_/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_unknown_/jvp/pjit__lambda__/Neg_1", "op": "Neg", "input": ["PartitionedCall/jax2tf_unknown_/jvp/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__reduce_sum_/BroadcastTo", "op": "BroadcastTo", "input": ["PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__reduce_sum_/Reshape", "PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__reduce_sum_/BroadcastTo/shape"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity_1", "op": "Identity", "input": ["PartitionedCall/jax2tf_unknown_/jvp/pjit__lambda__/Neg_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_unknown_/transpose/jvp/Mul", "op": "Mul", "input": ["PartitionedCall/Const_5", "PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__reduce_sum_/BroadcastTo"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit_fn_/Mul", "op": "Mul", "input": ["PartitionedCall/jax2tf_unknown_/transpose/jvp/Mul", "PartitionedCall/jax2tf_unknown_/jvp/Exp"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__lambda__/Neg_1", "op": "Neg", "input": ["PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit_fn_/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__reduce_sum_/Reshape_1", "op": "Reshape", "input": ["PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__lambda__/Neg_1", "PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__reduce_sum_/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__reduce_sum_/BroadcastTo_1", "op": "BroadcastTo", "input": ["PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__reduce_sum_/Reshape_1", "PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__reduce_sum_/BroadcastTo_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_unknown_/jvp/Mul_1", "op": "Mul", "input": ["PartitionedCall/Const_1", "PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__reduce_sum_/BroadcastTo_1"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_unknown_/transpose/jvp/Mul_1", "op": "Mul", "input": ["PartitionedCall/jax2tf_unknown_/jvp/Mul_1", "PartitionedCall/jax2tf_unknown_/jvp/pjit__lambda__/Sub"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__lambda__/Sum", "op": "Sum", "input": ["PartitionedCall/jax2tf_unknown_/transpose/jvp/Mul_1", "PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__lambda__/Sum/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__lambda__/Reshape", "op": "Reshape", "input": ["PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__lambda__/Sum", "PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__lambda__/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__lambda__/Neg_2", "op": "Neg", "input": ["PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__lambda__/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__lambda__/Sum_1", "op": "Sum", "input": ["PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__lambda__/Neg_2", "PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__lambda__/Sum_1/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/jax2tf_unknown_/pjit_fn_/Mul", "op": "Mul", "input": ["xs_2", "PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__lambda__/Sum_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_unknown_/pjit__lambda__/Sub", "op": "Sub", "input": ["xs_0", "PartitionedCall/jax2tf_unknown_/pjit_fn_/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["PartitionedCall/jax2tf_unknown_/pjit__lambda__/Sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_unknown_/pjit__lambda__/Sub_1", "op": "Sub", "input": ["PartitionedCall/jax2tf_unknown_/pjit__lambda__/Sub", "PartitionedCall/Const_12"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_unknown_/Reshape", "op": "Reshape", "input": ["PartitionedCall/jax2tf_unknown_/pjit__lambda__/Sub_1", "PartitionedCall/jax2tf_unknown_/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/jax2tf_unknown_/pjit_matmul_/MatMul", "op": "MatMul", "input": ["PartitionedCall/jax2tf_unknown_/Reshape", "PartitionedCall/jax2tf_unknown_/transpose"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "Identity_2", "op": "Identity", "input": ["PartitionedCall/jax2tf_unknown_/pjit_matmul_/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1482}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "PartitionedCall/Const_1", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__lambda__/Neg", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/jax2tf_unknown_/jvp/pjit__reduce_sum_/Sum_1/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__reduce_sum_/Reshape/shape", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__reduce_sum_/BroadcastTo/shape", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/Const_5", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/jax2tf_unknown_/jvp/pjit_fn_/Cast_1", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/jax2tf_unknown_/jvp/pjit_fn_/Mul", "shape": [15, 15], "dtype": "float32"}, {"name": "PartitionedCall/jax2tf_unknown_/pjit__one_hot_/Reshape/shape", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/jax2tf_unknown_/pjit__one_hot_/BroadcastTo_1", "shape": [15], "dtype": "int32"}, {"name": "PartitionedCall/jax2tf_unknown_/jvp/pjit_matmul_/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/jax2tf_unknown_/jvp/pjit__reduce_sum_/Sum/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/jax2tf_unknown_/jvp/pjit__reduce_max_/Max/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/Const_6", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/jax2tf_unknown_/jvp/Reshape/shape", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__reduce_sum_/Reshape_1/shape", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__reduce_sum_/BroadcastTo_1/shape", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/Const", "shape": [15, 65280], "dtype": "float32"}, {"name": "PartitionedCall/jax2tf_unknown_/jvp/pjit__lambda__/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__lambda__/Sum/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__lambda__/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/jax2tf_unknown_/transpose/jax2tf_unknown_/jvp/pjit__lambda__/Sum_1/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/Const_12", "shape": [65280], "dtype": "float32"}, {"name": "PartitionedCall/jax2tf_unknown_/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/jax2tf_unknown_/transpose", "shape": [65280, 2], "dtype": "float32"}]}]}